// const { json } = require("express");

let log = console.log;

// Завдання 1

/**
 * Функція `filterStudentsByGrade` фільтрує студентів за рівнем оцінки та виводить інформацію про них.
 *
 *  grade - Рівень оцінки для фільтрації.
 */
function filterStudentsByGrade(students, grade) {
  console.error(
    "Якщо ви бачите це повідомлення, то завдання 1 виконано не правильно"
  ); // Виведемо в консоль критичну помилку з текстом "Якщо ви бачите це повідомлення, то завдання 1 виконано не правильно"

  console.clear(); // Очищення консолі перед виведенням
  // Виведемо в консоль повідомлення для відстеження роботи програми з текстом: "Завдання: 1 =============================="
  log("Завдання: 1 ==============================");

  // За допомогою перебору масиву виведемо повідомлення для відстеження роботи програми з іменем кожного студента, який має необхідну оцінку
  for (let value of students) {
    // Відфільтруємо тільки тих студентів оцінка яких співпадає з grade
    if (value.grade === grade) {
      log(value);
    } else {
    }
  }
}

// Виклик функції для фільтрації студентів з рівнем "A"
filterStudentsByGrade(
  [
    { name: "John", grade: "A" },
    { name: "Kate", grade: "B" },
    { name: "Mike", grade: "A" },
    { name: "Anna", grade: "C" },
    { name: "Tom", grade: "B" },
  ],
  "A"
);

// Завдання 2
/**
 * Функція `logArrayElements` приймає масив та виводить кожен його елемент в консоль.
 *
 *  arr - Масив для обробки.
 */
function logArrayElements(arr) {
  // Перевіряємо, чи arr є масивом.
  if (!Array.isArray(arr)) {
    console.error("Аргумент має бути масивом!"); // Якщо arr не є масивом, виведеме в консоль критичну помилоку з текстом "Аргумент має бути масивом!"
    return null; // Повертаємо null, що свідчить про неможливість обробки вхідних даних.
  }
  // Перебираємо кожен елемент масиву.
  arr.forEach((element, key) => {
    element = arr[key];
    log(`Елемент ${key}: ${element}`); // Виводимо в консоль поточний елемент масиву та його індекс в форматі Елемент <індекс>: <значення>
  });
}

// Перевірка
log("Завдання: 2 ==============================");
logArrayElements([1, 2, 3, "a", "b", "c"]);
// Виведе в консоль:
// Елемент 0: 1
// Елемент 1: 2
// Елемент 2: 3
// Елемент 3: a
// Елемент 4: b
// Елемент 5: c

// Завдання 3
/**
 * Функція `warnAboutMaxArrayLength` перевіряє, чи перевищує довжина масиву вказане максимальне значення.
 *
 *  arr - Масив для перевірки.
 *  maxLength - Максимальна довжина масиву.
 */
function warnAboutMaxArrayLength(arr, maxLength) {
  // Перевіряємо, чи arr є масивом, а maxLength є числом.
  if (!Array.isArray(arr) || typeof maxLength !== "number") {
    console.error(
      "Перший аргумент має бути масивом, другий аргумент має бути числом!"
    ); // Якщо arr не є масивом або maxLength не є числом, виведеме в консоль критичну помилоку з текстом: "Перший аргумент має бути масивом, другий аргумент має бути числом!".
    return null; // Повертаємо null, що свідчить про неможливість обробки вхідних даних.
  } else {
    // Перевіряємо, чи довжина масиву перевищує максимальну допустиму довжину.
    if (arr.length > maxLength) {
      console.warn("Увага! Довжина масиву перевищує максимально допустиму!"); // Якщо довжина масиву перевищує максимальну, виводимо попередження про потенційну проблеми з текстом: "Увага! Довжина масиву перевищує максимально допустиму!".
    } else {
      console.info("Довжина масиву не перевищує максимально допустиму."); // Якщо довжина масиву не перевищує максимальну, виведеме в консоль корисне повідомлення з текстом: "Довжина масиву не перевищує максимально допустиму.".
    }
  }
}

// Перевірка
console.log("Завдання: 3 ==============================");
warnAboutMaxArrayLength([1, 2, 3, 4, 5], 3);
// Виведе в консоль попередження: "Увага! Довжина масиву перевищує максимально допустиму!".

// Завдання 4
/**
 * Функція `compareArrays` приймає два масиви чисел як аргументи і порівнює їх.
 * Вона використовує `console.assert()` для перевірки того, чи обидва масиви є однаковими.
 *
 *  arr1 - Перший масив чисел.
 *  arr2 - Другий масив чисел.
 */
function compareArrays(arr1, arr2) {
  arr1 = arr1.sort((a, b) => a - b); // Сортуємо масив за ключами у порядку зростання.
  //   log(a[0], b[0]);
  //   log(arr1);
  arr2 = arr2.sort((a, b) => a - b); // Сортуємо масив за ключами у порядку зростання.
  //   log(arr2);

  // Оскільки напряму порівняти масиви за допомогою оператора === не можно, перетворимо ії в json і порівняємо
  let json1 = { ...arr1 };
  json1 = JSON.stringify(json1);
  let json2 = { ...arr2 };
  json2 = JSON.stringify(json2);

  //   log(json1, json2);
  console.assert(json1 == json2, "Масиви не однакові!!!"); // Використовуємо `console.assert()`, щоб вивести помилку, якщо масиви не однакові.
}

console.log("Завдання: 4 ==============================");
compareArrays([1, 2, 3, 4, 5], [1, 2, 3, 4]);
// Виведе "Assertion failed: Масиви не однакові!"

// Завдання 5
/**
 * Функція `buildMatrix` створює двовимірний масив (матрицю) розміром size x size,
 * заповнює її випадковими числами від 0 до 9, а потім виводить матрицю в консоль
 *
 *  size - розмір матриці.
 *  Повернеться згенерована матриця.
 */
function buildMatrix(size) {
  // Перевіряємо, чи size є числом.
  if (typeof size !== "number") {
    console.error("Аргумент має бути числом!"); // Якщо size не є числом, виведеме в консоль критичну помилку з текстом "Аргумент має бути числом!".
    return null; // Повертаємо null, що свідчить про неможливість обробки вхідних даних.
  } else {
    let arr = []; // Створюємо порожній масив який буде нашою матрицею.
    // Цикл для заповнення рядків матриці, лічильник і має бути від 0 до розміру матриці.
    for (let i = 0; i < size; i++) {
      let arrString = []; // Створюємо порожній масив, який буде рядком матриці.
      // Цикл всередені циклу для заповнення колонок матриці,лічильник j має бути від 0 до розміру матриці.
      for (let j = 0; j < size; j++) {
        // От 0 до 9
        let generatorRandom = Math.trunc(Math.random() * 10); // Генеруємо випадкове число від 0 до 9 округляємо його до меншого цілого, і додаємо його до рядка.
        // log(generatorRandom);
        arrString.push(generatorRandom);
      }
      arr.push(arrString); // Додаємо рядок до матриці.
    }
    console.table(arr); // Виводимо матрицю в консоль за допомогою як таблицю.
    return arr; // Повертаємо створену матрицю.
  }
}

console.log("Завдання: 5 ==============================");
buildMatrix(5);
// Виведе в консоль матрицю розміром 5x5, заповнену випадковими числами від 0 до 9.

// Завдання 6
/**
 * Функція `traceBackward` виводить числа від заданого до 1 у зворотному порядку,
 * використовуючи рекурсію.
 *
 *  n - стартове число.
 */
function traceBackward(n) {
  console.log(n); // Виводимо поточне число n.
  // Якщо n є більше 1, викликаємо функцію traceBackward знову з аргументом n - 1.
  if (n > 1) {
    traceBackward(n - 1);
    // Виведемо стек викликів, коли досягнемо 1.
  } else {
    traceBackward = () => console.trace("Reached the end");
    traceBackward();
  }
}

console.log("Завдання: 6 ==============================");
traceBackward(5);
// Виведе в консоль числа від 5 до 1, а потім виведе стек викликів.

// Завдання 7
/**
 * Функція `displayGroupedInfo` виводить інформацію про групу студентів в консоль, організовуючи дані у групи.
 * students - масив об'єктів-студентів.
 */
function displayGroupedInfo(students) {
  // Переберомо об'єкт за допомого for of
  for (let student of students) {
    // log(student);
    console.group(`Студент: ${student.name}`); // Створимо групу з повідомленням `Студент: ${student.name}`
    console.info(`Вік: ${student.age}`); // Виведемо корисне повідомлення з текстом `Вік: ${student.age}`
    console.info(`Предмет: ${student.subject}`); // Виведемо корисне повідомлення з текстом `Предмет: ${student.subject}`
    console.groupEnd(); // Закриємо групу
  }
}

console.log("Завдання: 7 ==============================");
displayGroupedInfo([
  { name: "Alex", age: 22, subject: "Math" },
  { name: "Max", age: 23, subject: "Physics" },
  { name: "Anna", age: 21, subject: "Chemistry" },
]);
// Виведе в консоль:
// Студент: Alex
//   Вік: 22
//   Предмет: Math
// Студент: Max
//   Вік: 23
//   Предмет: Physics
// Студент: Anna
//   Вік: 21
//   Предмет: Chemistry

// Завдання 8
/**
 * Функція `validateUserInput` перевіряє коректність введених користувачем даних.
 * Для цього використовуємо `console.warn()` та `console.assert()`.
 *
 *  userInput - об'єкт з введеними користувачем даними.
 */
function validateUserInput(userInput) {
  console.assert(
    "username" in userInput,
    "Помилка: ім'я користувача відсутнє!"
  ); // Перевіремо умову наявності імені користувача, якщо воно відсутнє виводимо "Помилка: ім'я користувача відсутнє!"

  console.assert("password" in userInput, "Помилка: пароль відсутній!"); // Перевіремо умову наявності паролю, якщо він відсутній виводимо "Помилка: пароль відсутній!"

  console.assert(
    userInput["password"].length > 8,
    "Попередження: пароль має бути довшим за 8 символів!"
  ); // Перевірка довжини паролю чи менше вона ніж 8,якщо ні виводимо повідомлення про потенційну проблему з текстом "Попередження: пароль має бути довшим за 8 символів!"
}

console.log("Завдання: 8 ==============================");
validateUserInput({ username: "alex", password: "pass" });
// Виведе в консоль:
// Попередження: пароль має бути довшим за 8 символів!

// Завдання 9
/**
 * Функція `calculateTotalPrice` обчислює загальну вартість товарів та логує час виконання.
 *
 * products - Масив об'єктів товарів з властивостями `price` та `title`.
 */
function calculateTotalPrice(products) {
  console.time("timerCalculetorTotalPrice"); // Початок вимірювання часу

  let total = 0; // Створення змінної total яка буде нашою загальную ціною, початкове значення нуль

  // Перебираємо кожен об'єкт товару та...
  products.forEach((item) => {
    // log(item.price);
    total += item.price; // ...додаємо ціну товару до загальної вартості
  });

  log("Загальна вартість товарів:", total); // Виведення загальної вартості товарів у форматі "Загальна вартість товарів:", total
  console.timeEnd("timerCalculetorTotalPrice"); // Зупинка вимірювання та виведення часу
}

console.log("Завдання: 9 ==============================");
const products = [
  { title: "Телефон", price: 1000 },
  { title: "Ноутбук", price: 2000 },
  { title: "Планшет", price: 500 },
];

calculateTotalPrice(products);
// Виведе
// Загальна вартість товарів: 3500
// calculateTotalPrice: 0.994ms (час може відрізнятись)

// Завдання 10
/**
 * Функція `countVowelsAndConsonants` пораховує кількість голосних і приголосних літер у слові.
 *
 *  word - слово, для якого потрібно порахувати кількість літер.
 */
function countVowelsAndConsonants(word) {
  let vowels = 0;
  let consonants = 0;

  let vowelsString = "aeiou"; // Створюємо рядок де будуть всі голосні "aeiou"
  // Перебираємо кожну літеру у слові за допомогою for of
  for (let value of word) {
    value = value.toLowerCase(); // Перетворюємо літеру на малу літеру для порівняння
    // Перевіряємо, чи є літера в нашому рядку з голосними, якщо так, то виводимио лічильник голосних, інакше приголосних
    if (vowelsString.includes(value)) {
      vowels++;
      log(`Голосна: ${vowels}`); // Скидаємо лічильники
    } else {
      consonants++;
      log(`Приголосна: ${consonants}`); // Скидаємо лічильники
    }
  }
}
console.log("Завдання: 10 ==============================");
countVowelsAndConsonants("HelloWorld!");
